Repository: alexm/shadow.cat
Catalog: shadow.cat-level2.tmx
Source language: en_us
Languages: ca

source: The Moose is Flying (part 1) (Jun 07)
ca: El Moose està volant (1a part) (juny 07)

source: The Perl Review: the magazine of Perl
ca: The Perl Review: la revista de Perl

source: Worldwide training and consulting by Perl experts
ca: Formació i consultoria arreu del món per experts en Perl

source: Jump to content...
ca: Salteu al contingut...

source: Columns
ca: Columnes

source: Pictures
ca: Fotografies

source: Columns by Randal
ca: Columnes d'en Randal

source: LM Columns
ca: Columnes a LM

source: PJ Columns
ca: Columnes a PJ

source: UR Columns
ca: Columnes a UR

source: WT Columns
ca: Columnes a WT

source: LM Columns by Randal
ca: Columnes d'en Randal a LM

source: Search Stonehenge
ca: Cerqueu a Stonehenge

source: Most-recently modified on 08:05:54 11-May-2007.
ca: Darrera modificació a les 08:05:54 11-May-2007.

source: Copyright Notice
ca: Avís de copyright

source: This text is copyright by InfoStrada Communications, Inc., and is used with their permission.
ca: El copyright d'aquest text és propietat d'InfoStrada Communications, Inc. i s'utilitza amb el seu permís.

source: Further distribution or use is not permitted.
ca: Qualsevol altre tipus de difusió o ús no està permès.

source: This text has appeared in an edited form in Linux Magazine magazine.
ca: Aquest text va aparèixer en una edició de la revista Linux Magazine.

source: However, the version you are reading here is as the author originally submitted the article for publication, not after their editors applied their creativity.
ca: Tanmateix, la versió que esteu llegint aquí és l'article original tal com l'autor el va enviar per a ser publicat, abans que els editors apliquessin la seva creativitat.

source: Please read all the information in the table of contents before using this article.
ca: Si us plau, llegiu tota la informació de l'índex abans d'utilitzar aquest article.

source: Linux Magazine Column 94 (Jun 2007)
ca: Columna 94 del Linux Magazine (juny de 2007)

source: [suggested title: ``The Moose is Flying (part 1)'']
ca: [títol suggerit: «El Moose està volant (1a part)»]

source: Perl's object system is very ``flexible'', meaning, you get to build it from the ground up.
ca: El sistema d'objectes de Perl és molt «flexible», és a dir, es construeix de baix cap a dalt.

source: You can build traditional hash-based objects, or more exotic array-based or inside-out objects.
ca: Podeu construir objectes tradicionals basats en taules de dispersió, o objectes més exòtics basats en matrius o objectes capgirats.

source: And then you have to create the accessors, define access policies, and perform a lot of repetitive code.
ca: Aleshores heu de crear els mètodes accessors, definir les polítiques d'accés i generar un munt de codi repetit.

source: Luckily, Perl is introspective enough that you can get Perl to do most of the hard boring work.
ca: Afortunadament, Perl és prou introspectiu com perquè li encomaneu la majoria del treball dur i avorrit.

source: This has resulted in a number of ``class frameworks'' finding their way onto the CPAN.
ca: Això ha provocat que un bon nombre «d'entorns de treball per a classes» hagin estat publicats al CPAN.

source: The Moose framework appeared about a year ago, and I initially dismissed it as ``yet another class framework'', much in the same way as I feel about yet another templating system or object-relational mapper.
ca: L'enton de treball Moose va sorgir fa un any i inicialment jo el vaig descartar com «un altre entorn de treball per a classes», de la mateixa manera que un altre sistema de plantilles o un altre mapeig d'objectes relacional em fan sentir.

source: However, I recently took a look at what Moose had become, and was pleasantly surprised.
ca: Tanmateix, vaig fer un cop d'ull recentment al que s'havia convertit Moose i em vaig endur una sorpresa agradable.

source: As I started playing with it, I exclaimed frequently that this framework would have saved me quite a bit of time on some past projects, such as the text I wrote for our Intermediate Perl course and book, parts of which have been included as the perlboot manpage in the distribution.
ca: Així que em vaig posar a jugar-hi, sovint vaig exclamar que aquest entorn de treball m'hauria estalviat un bona pila de temps en alguns projectes passats, com ara el text que vaig escriure per al nostre curs i llibre Intermediate Perl, algunes parts del qual s'han inclòs com la pàgina de manual perlboot a la distribució.

source: Let's recreate the ``animal'' classes from that text, using Moose, to see how this emerging framework simplifies things.
ca: Posem-nos a refer les classes «d'animals» d'aquell text utilitzant Moose per veure com aquest entorn de treball emergent simplifica les coses.

source: First, we'll create a horse class in Horse.pm that has a name and a color:
ca: Primer crearem la classe cavall a Horse.pm que té un nom i un color:

source: Bringing in Moose defines has, which takes the name of an attribute along with its properties.
ca: Incorporant Moose es defineix has, al qual se li passa el nom d'un atribut juntament amb les seves propietats.

source: Here, we're saying that the two attributes are ``read/write''.
ca: En aquest cas, diem que els dos atributs són de «lectura/escriptura».

source: We can now use this class:
ca: Ara podem utilitzar aquesta classe:

source: Note that I didn't have to define a new method: Moose does that for me.
ca: Fixeu-vos que no m'ha calgut definir un mètode new: Moose ho fa per mi.

source: Now in the original text, Horse inherited from Animal.
ca: En el text original Horse heretava d'Animal.

source: We can do that rather simply.
ca: Podem fer això molt fàcilment.

source: In Animal.pm, we place:
ca: Posem a Animal.pm:

source: And then update our Horse.pm:
ca: I aleshores actualitzem el nostre Horse.pm:

source: Note that extends here replaces the traditional use base and completely sets @ISA, rather than adding to it.
ca: Fixeu-vos que aquí extends substitueix el tradicional use base i fixa completament @ISA, enlloc d'afegir-hi un element.

source: (It's possible that you might want to put this inside a BEGIN block, although I've not seen any examples requiring it yet.)
ca: (És possible que vulgueu posar això dins d'un bloc BEGIN, tot i que encara no he vist cap exemple que ho necessiti).

source: At this point, Horse and Animal are identical.
ca: En aquest punt, Horse i Animal són idèntics.

source: They can both be instantiated, and have the two given attributes.
ca: Els dos es poden instanciar i se'ls pot assignar atributs.

source: In the original example, what distinguished a horse was the sound it made, which we can add here:
ca: En l'exemple original, el que distingia un cavall era el so que feia, cosa que podem afegir aquí:

source: and then reference that in the common speak method in Animal:
ca: i aleshores fer-hi referència al mètode comú speak d'Animal:

source: Note the use of confess, another freebie from Moose.
ca: Fixeu-vos en l'ús de confess, un altre regal de Moose.

source: If the derived class hasn't defined a sound, I want to complain.
ca: Si la classe derivada no ha definit un so, vull queixar-me.

source: But since Horse defines sound, I'll never see that for a horse.
ca: Però com que Horse defineix sound, no veure mai això per un cavall.

source: With this code, I can create my classic talking horse:
ca: Amb aquest codi puc crear el meu clàssic cavall parlador:

source: So far, I'm still coding things that would be simple without Moose, so let's start diverging a bit to see the full power.
ca: Fins ara només estic programant coses que serien senzilles sense Moose, així que comencem a fer alguns canvis per veure'n tot el poder.

source: First, an Animal is really an abstract class, being used only to provide common attributes and methods to a concrete class (in this case, the horse class).
ca: Primer, un Animal és en realitat una classe abstracta, utilitzada només per proveïr atributs i mètodes comuns per a una classe concreta (en aquest cas, la classe cavall).

source: In Moose-terminology, this can best be described as a role.
ca: En la terminologia de Moose això es descriu millor com un rol.

source: A role is like a mix-in, providing a collection of attributes and methods that use those attributes.
ca: Un rol és com un mix-in, que proveeix una col·lecció d'atributs i mètodes que utilitzen aquells atributs.

source: A role never has any instances, because it's not a complete class.
ca: Un rol mai té cap instància perquè no és una classe completa.

source: When we make Animal a role, we'll also get some additional support:
ca: Quan fem que Animal sigui un rol també obtenim suport addicional:

source: Note that we've replaced the confess-including stub with requires.
ca: Fixeu-vos que hem substituït l'«stub» que incloïa el confess per un requires.

source: This informs Moose that this role must now be used with a class that provides the sound method, which will be checked at compile-time.
ca: Això informa a Moose que les classes que usin aquest rol han de proveir el mètode sound, que serà verificat en temps de compilació.

source: To pull in a role, we use with rather than extends:
ca: Per atorgar un rol utilitzem with enlloc d'extends:

source: Had we failed to include sound, we'd get notification very early on.
ca: Si ens haguéssim oblidat d'incloure sound hauríem rebut un avís de bon començament.

source: Cool.
ca: Genial.

source: At this point, Horse otherwise still works as before.
ca: En aquest punt, Horse segueix funcionant com abans.

source: What about those with and requires keywords?
ca: Què passa amb les paraules clau with i requires?

source: Because they're defined by the Moose and Moose::Role imports, they remain as part of the package.
ca: Com que estan definits per les importacions de Moose i Moose::Role, romandran com a part del paquet.

source: For the purists in us who don't like that kind of pollution, we can throw them away when we're done, using the correponding no keyword (similiar to use strict and no strict).
ca: Per als puristes com nosaltres als que no ens agrada aquest tipus de pol·lució, podem eliminar-los quan hàgim acabat utilitzant la paraula clau no (de forma similar a use strict i no strict).

source: For example, we'd clean up Horse.pm with:
ca: Per exemple, podem netejar Horse.pm amb:

source: And similarly, Animal.pm requires no Moose::Role at the end.
ca: I de forma similar, Animal.pm necessita no Moose::Role al final.

source: Moose supports the notion of a default value.
ca: Moose ofereix suport per a la noció de valor predeterminat.

source: Let's add in the default color, and make that a class responsibility as well:
ca: Afegim el color predeterminat i fem que això també sigui responsabilitat de la classe:

source: If the color isn't provided, the default color of the class will be consulted, and requires ensures that the concrete class provides this default color.
ca: Si no s'indica el color, es consultarà el color predeterminat de la classe i requires garanteix que la classe concreta proveeix aquest color predeterminat.

source: Our derived animal classes now look like:
ca: Les nostres classes derivades ara tenen aquest aspecte:

source: Now we can count sheep as one of our implemented classes:
ca: Ara «ovella» és una més de les nostres classes implementades:

source: Well, this is pretty straightforward.
ca: Bé, això és força pim pam.

source: Let's solve a few other problems from the original material.
ca: Anem a resoldre alguns dels altres problemes del material original.

source: The Mouse class was special, because it extended the speak method with an additional line of output.
ca: La classe Mouse era especial perquè extenia el mètode speak amb una línia addicional de sortida.

source: While we could use traditional SUPER::-based method calls to call parent-class behaviors, this doesn't work with roles.
ca: Tot i que podríem utilitzar els mètodes tradicionals basats en SUPER:: per cridar els comportaments de la classe pare, això no funciona amb els rols.

source: (Roles don't end up in @ISA, because they're ``glued in'' rather than ``tacked above''.)
ca: (Els rols no acaben dins de @ISA perquè estan «empegats per dins» enlloc d'«enganxats al damunt»).

source: Luckily, Moose provides the convenient after call to append additional steps to an existing subroutine.
ca: Afortunadament, Moose ofereix convenientment la crida after per afegir passes addicionals al final d'una subrutina existent.

source: Moose does this by replacing the original subroutine with a new subroutine that calls the original routine and then calls the additional code.
ca: Moose fa això substituint la subrutina original per una nova subrutina que crida l'orginal i tot seguit crida al codi addicional.

source: The context (list, scalar, or void) is properly preserved, as is the original return value.
ca: El context (llista, escalar, o buit) es conserva de forma adequada, així com també el valor de retorn original.

source: Our amended speak looks something like:
ca: El nostre speak retocat té aquesta pinta:

source: This gives us a properly functioning mouse:
ca: Això ens dóna un ratolí que funciona correctament:

source: which results in:
ca: que dóna com a resultat:

source: We can also use before and around to precede the original behavior or control the calling of the original behavior, as necessary.
ca: També podem utilitzar before per a precedir el comportament original o around per a controlar com es crida el comportament original, segons calgui.

source: For example, to allow name to be used as both an accessor and still return an unnamed Horse when used as a class method, we can ``around'' the resulting name accessor:
ca: Per exemple, per a permetre que name s'utilitzi com un mètode accessor però que segueixi retornant an unnamed Horse quan s'utilitzi com un mètode de classe, podem posar un «around» del mètode accessor resultant:

source: The has creates the original behavior.
ca: El has crear el comportament original.

source: The around intercepts the original subroutine name, causing the original coderef to be passed as the first parameter to this new subroutine, which we capture in $next.
ca: L'around intercepta el nom de la subroutina original, fent que la referència al codi original es passi com a primer paràmetre d'aquesta nova subrutina, que nosaltres capturem a $next.

source: The original $self is shifted away, and tested to see if it's an object or not, via blessed (conveniently exported via Moose).
ca: Desencuem el $self original i el verifiquem per veure si és un objecte o no, via blessed (exportat per Moose convenientment).

source: For a blessed object, we get the original behavior (a getter or setter), but for a class, we'll get the literal string.
ca: Per a un objecte obtenim el comportament original (un «getter» o «setter»), però per a una classe obtindrem la cadena literal.

source: What if we never gave our animal a name?
ca: Què passa si no li posem un nom al nostre animal?

source: We'll get warnings about undefined values.
ca: Obtindrem avisos sobre valors indefinits.

source: We can give a default name just as we did a default color:
ca: Podem assignar un nom predeterminat tal com vam fer amb el color predeterminat:

source: Again, we'd want that around immediately following this step.
ca: Novament, voldríem aquell around immediatament després d'aquest pas.

source: If we don't want people setting the color after the initial instance creation, we can declare the attribute as read-only:
ca: Si no volem que la gent canviï el color després de la creació inicial de la instància, declarem l'atribut no modificable:

source: Now an attempt to set the color is aborted with Cannot assign a value to a read-only accessor....
ca: Ara un intent de canviar el color s'avortarà amb Cannot assign a value to a read-only accessor....

source: If we really wanted to have a way to occasionally set the color, we can define a separately named writer:
ca: Si realment volíem una manera de canviar el color ocasionalment, podem definir a banda un anomenat escriptor:

source: Thus, we can't change the color of a mouse directly:
ca: D'aquesta manera no podem canviar el color d'un ratolí directament:

source: But we can use our private name instead:
ca: Però en canvi podem utilitzar un mètode privat:

source: By using a long name, we're less likely to accidentally call it, except where we intentionally want to change the color.
ca: Tot utilitzant un nom llarg és menys probable que el cridem accidentalment, a menys que tinguem la intenció de canviar el color.

source: Let's create a RaceHorse by adding ``race features'' to a Horse.
ca: Anem a crear un RaceHorse afegint «característiques de carrera» a un Horse.

source: First, we define the ``race features'' as, yes, another role:
ca: Primer definim «característiques de carrera» com, sí, un altre rol:

source: Note that since has is just a subroutine call, we can use traditional Perl control structures (here, a foreach loop).
ca: Com que has és només una crida a una subrutina, fixeu-vos que podem utilitzar estructures de control tradicionals de Perl (aquí, un bucle foreach).

source: With a bit of code, we've added another four attributes.
ca: Amb una mica de codi hem afegit uns altres quatre atributs.

source: The initial value of 0 means we don't have to write separate initialization code in our constructor.
ca: El valor inicial 0 significa que no ens caldrà escriure per separat codi d'inicialització al nostre constructor.

source: Next, we can add some accessors:
ca: Tot seguit podem afegir alguns mètodes accessors:

source: Each call to won increments the number of wins.
ca: Cada crida a won incrementa el número de victòries.

source: This would be simpler if we presumed that these objects are implemented as hashes (which they are by default), as:
ca: Això seria més senzill si assumíssim que aquests objectes s'implementen amb taules de dispersió (per defecte és així), com ara:

source: However, by using the public interface (a method call), we could change the implementation later to inside-out objects or array-based objects without breaking this code.
ca: Tanmateix, utilitzant la interfície pública (una crida al mètode) podríem canviar més endavant la implementació amb objectes capgirats o objectes basats en matrius sense trencar aquest codi.

source: This is especially important when creating a generic role, which could be mixed in to any kind of object.
ca: Això és especialment important quan es crea un rol genèric, que es podria mesclar amb qualsevol tipus d'objecte.

source: To create the race horse, we just mix a horse with a racer:
ca: Per a crear la carrera de cavalls només cal que mesclem un cavall amb un corredor:

source: And now we can ride the ponies:
ca: I ara ja podem cavalcar els ponis:

source: So far, I've just scratched the surface of what Moose provides.
ca: Fins ara només he rascat la superfície del que proporciona Moose.

source: Next month, I'll look at some of the more advanced features of Moose that help keep the complex things relatively simple.
ca: El proper mes miraré algunes de les característiques més avançades de Moose que ajuden a mantenir les coses complexes de manera relativament simple.

source: Until then, enjoy!
ca: Fins aleshores, gaudiu!

source: Randal L. Schwartz is a renowned expert on the Perl programming language (the lifeblood of the Internet), having contributed to a dozen top-selling books on the subject, and over 200 magazine articles.
ca: Randal L. Schwartz és un expert de renom sobre el llenguatge de programació Perl (l'essència vital d'Internet), que ha contribuït en una dotzena de llibres supervendes en la matèria i més de 200 articles en revistes.

source: Schwartz runs a Perl training and consulting company (Stonehenge Consulting Services, Inc of Portland, Oregon), and is a highly sought-after speaker for his masterful stage combination of technical skill, comedic timing, and crowd rapport.
ca: En Schwartz té una empresa de formació i consultoria en Perl (Stonehenge Consulting Services, Inc de Portland, Oregon) i és un conferenciant molt buscat gràcies a la seva destresa damunt l'escenari, que combina coneixements tècnics, pauses dramàtiques i sintonia amb el públic.

source: And he's a pretty good Karaoke singer, winning contests regularly.
ca: I és força bon cantant de Karaoke, que guanya concursos sovint.

source: Schwartz can be reached for comment at merlyn@stonehenge.com or +1 503 777-0095, and welcomes questions on Perl and other related topics.
ca: Podeu contactar en Schwartz per a comentaris a merlyn@stonehenge.com o al telèfon +1 503 777-0095, i accepta preguntes sobre Perl i d'altres temes relacionats.

source: The Moose is Flying (part 2) (Jul 07)
ca: El Moose està volant (2a part) (juliol 07)

source: [suggested title: ``The Moose is Flying (part 2)'']
ca: [títol suggerit: «El Moose està volant (2a part)»]

source: Last month, I introduced the Moose object system by walking through the code developed in the perlboot manpage, rewriting it to use Moose.
ca: El mes passat, vaig introduir el sistema d'objectes Moose recorrent el codi desenvolupat a la pàgina de manual de perlboot , reescrivint-ho per utilitzar Moose.

source: Continuing from that discussion, let's look at some of the features I didn't cover last month.
ca: Continuant a partir d'aquella discussió, fem un cop d'ull a algunes de les característiques que no vaig cobrir el mes passat.

source: Our Animal role included attributes of name, and color, and actions of speak and eat.
ca: El nostre rol Animal incloïa atributs de name i color, i mètodes de speak i eat.

source: We can add a birthdate attribute to the mix with:
ca: Podem afegir un atribut d'aniversari a la barreja amb:

source: As we don't want to be able to change the birthdate, we'll make it read-only.
ca: Com que no volem que es pugui canviar la data d'aniversari, farem que sigui no modificable.

source: By default, this attribute accepts any scalar, so these are all equally valid:
ca: Per defecte, aquest atribut accepta qualsevol escalar, així que aquests són tots equivalentment vàlids:

source: We can get a bit of help from Moose to narrow down the permissible type of this new birthdate attribute using Moose's typing system:
ca: Podem aconseguir una mica d'ajuda de Moose per reduir el tipus permès d'aquest nou atribut aniversari utilitzant el sistema de tipus de Moose:

source: The isa parameter here declares that the born parameter must be a DateTime object, or at least something that responds true to UNIVERSAL::isa($thing, "DateTime").
ca: El paràmetre isa declara aquí que el paràmetre born ha de ser un objecte DateTime, o com a mínim algun tipus que respongui cert a UNIVERSAL::isa($thing, "DateTime").

source: Now, if we try to put anything in this born attribute other than a DateTime, we get a run-time error.
ca: Ara, si intentem assignar qualsevol cosa a l'atribut born que no sigui un DateTime, obtenim un error en temps d'execució.

source: So, this fails:
ca: Així doncs, això falla:

source: But this succeeds:
ca: Però això funciona:

source: The DateTime string for isa refers here to the Perl class.
ca: La cadena DateTime per isa es refereix aquí a la classe de Perl.

source: However, we can also define this as an artificial Moose type:
ca: Tanmateix, també podem definir això com un tipus de Moose artificial:

source: This works like before, but now identifies DateTime as a Moose-type.
ca: Això funciona com abans, però ara identifica DateTime com un tipus de Moose.
